Catagorial Data has 2 types:

1. Nominal or Unordinal
2. Ordinal or Ordered

1. Nominal Data :
             When collecting nominal data we assigning individual items to named categories that do not have on implict or actual value of rank
     
2. Ordinal Data:
           Ordinal data in which items are to catagories that do have some kind of implict or natural order such as             "short,medium or tall"

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as snb

In [2]:
df = pd.read_csv("Downloads/titanic_data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
## Assign the categorical data to some varialble for easy accesing

In [4]:
catagorical_data = df.select_dtypes(include="object")

In [5]:
catagorical_data.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [6]:
# Check for null values

catagorical_data.isnull().sum()

Name          0
Sex           0
Ticket        0
Cabin       687
Embarked      2
dtype: int64

In [7]:
# Cabin having 687 Null Values and its belongs to ordinal data because cabin decided based on amount you pay .
# Embarked having 2 Null values and its belongs to Nominal data because it doesn't follows oreder wise

In [8]:
# Handling Null Values for Nominal Data

Null values in Nominal data Handling by 2 techniques

1.Replacing with most repeated value
2.Replacing with new values

In [9]:
catagorical_data['Embarked'].isnull().sum()

2

In [10]:
catagorical_data["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
catagorical_data["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [12]:
# Replacing with most repeated values means mode value

In [13]:
mode = catagorical_data["Embarked"].mode()

In [14]:
mode

0    S
dtype: object

In [15]:
import warnings
warnings.filterwarnings('ignore')

In [16]:
# creating new column
catagorical_data["Embarked_replaced"] = catagorical_data["Embarked"].fillna(mode[0])

In [17]:
catagorical_data.columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked', 'Embarked_replaced'], dtype='object')

In [18]:
catagorical_data["Embarked_replaced"].isnull().sum()

0

In [19]:
catagorical_data['Embarked_replaced'].value_counts()

S    646
C    168
Q     77
Name: Embarked_replaced, dtype: int64

In [20]:
# WE succesfully replaced null vaues into mode values so we can remove Embarked column
# Name and Ticket colums has no use for analysis so that columns aslo will remove

catagorical_data = catagorical_data.drop(["Embarked",'Ticket',"Name"],axis=1)

In [21]:
catagorical_data.head()

      Sex Cabin Embarked_replaced
0    male   NaN                 S
1  female   C85                 C
2  female   NaN                 S
3  female  C123                 S
4    male   NaN                 S

In [22]:
# Hanlinbg the Nominal Data

# 'Cabin' is the Oridanl Data so this will handle sepearatlt.

catagorical_data = catagorical_data.drop(['Cabin'],axis=1)

In [23]:
catagorical_data.head()

      Sex Embarked_replaced
0    male                 S
1  female                 C
2  female                 S
3  female                 S
4    male                 S

In [24]:
## one hot encoding for Nominal Data

# 1) Dummies
# 2) count/frequncy ->multiple nominal columns 

# Replace the Nominal Values with Dummy Enteris.

In [25]:
a= pd.get_dummies(catagorical_data["Sex"],drop_first=True)
a.head()

   male
0     1
1     0
2     0
3     0
4     1

In [26]:
b = pd.get_dummies(catagorical_data["Embarked_replaced"],drop_first=True)
b.head()

   Q  S
0  0  1
1  0  0
2  0  1
3  0  1
4  0  1

In [27]:
catagorical_data = pd.concat([catagorical_data,a,b],axis=1)

In [28]:
catagorical_data.head()

      Sex Embarked_replaced  male  Q  S
0    male                 S     1  0  1
1  female                 C     0  0  0
2  female                 S     0  0  1
3  female                 S     0  0  1
4    male                 S     1  0  1

In [29]:
catagorical_data = catagorical_data.drop(['Sex','Embarked_replaced'],axis=1)

In [30]:
catagorical_data.head()

   male  Q  S
0     1  0  1
1     0  0  0
2     0  0  1
3     0  0  1
4     1  0  1

In [31]:
## Successfully handled the all nominal values